Projects/cht-heat-exchanger-automation/heatExchanger_base/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtMultiRegionSimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


functions
{
    Tin_air
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");

        enabled         true;
        region          air;

        log             true;
        writeControl    writeTime;
        writeFields     false;

        regionType      patch;
        name            inlet;

        operation       areaAverage;
        fields          (T);
    }

    Tout_air
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");

        enabled         true;
        region          air;

        log             true;
        writeControl    writeTime;
        writeFields     false;

        regionType      patch;
        name            outlet;

        operation       areaAverage;
        fields          (T);
    }

    Pin_air
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");

        enabled         true;
        region          air;

        log             true;
        writeControl    writeTime;
        writeFields     false;

        regionType      patch;
        name            inlet;

        operation       areaAverage;
        fields          (p_rgh);
    }

    Pout_air
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");

        enabled         true;
        region          air;

        log             true;
        writeControl    writeTime;
        writeFields     false;

        regionType      patch;
        name            outlet;

        operation       areaAverage;
        fields          (p_rgh);
    }

    mdot_air_out
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");

        enabled         true;
        region          air;

        log             true;
        writeControl    writeTime;
        writeFields     false;

        regionType      patch;
        name            outlet;

        operation       sum;
        fields          (phi);
    }

    Tout_porous
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");

        enabled         true;
        region          porous;

        log             true;
        writeControl    writeTime;
        writeFields     false;

        regionType      patch;
        name            outlet;

        operation       areaAverage;
        fields          (T);
    }
}



// ************************************************************************* //
